class fakrwgawebdata{
  List<List<String>> questions=[
   /* ["ما هى عاصمة جمهورية  سان مارينو؟","ما اكثر القارات تسطحا؟","من كان قائد المغول فى معركة عين جالوت؟","من حكم مصر بعد الخديوي اسماعيل؟","من مولف رواية احدب نوتردام؟","من مولف رواية عمارة يعقوبيان؟","ما اكثر الغازات انتشارا فى الغلاف الجوى؟","ما مجموع اقمار كوكب عطارد و الزهرة و الارض؟"],*/
   /* ["","","","","","","",""],*/
    /*["في اي قارة توجد صحراء كلهاري؟","في اي محافظة مصرية توجد محمية سالوجا و غزال؟","من هو والي مصر الذي قام بإعادة حفر قناه تربط النيل بالبحر الأحمر؟ ","ما هي الدولة العربية التي قامت فرنسا باحتلالها عام ١٨٣٠؟","من هو كاتب نشيد اسلمي يا مصر؟","من هو كاتب نص رثاء مي؟","من كم جزء تتكون اذن الإنسان؟","ما هو الرمز الكيميائي لغاز الميثان؟"],*/
    ["فى اى قارة يقع بحر قزوين؟","ما عدد خطوط الطول","في اي عقد من القرن العشرين تم اكتشاف مقبرة توت عنخ امون؟","من هو قائد الحملة الانجليزية الفاشلة على مصر عام ١٨٠٧؟","`اذا انت اكرمت الكريم ملكته و ان انت اكرمت اللئيم تمرد`    من قائل البيت السابق؟","من هو الأديب المصري الراحل صاحب عبارة : الخوف لا يمنع الموت لكنه يمنع من الحياه؟","ما هو الفيتامين الذي يساعد على امتصاص الكالسيوم ","علي سطح اي عضو توجد الغضة الكظرية ( adrenal gland) ؟"],
    ["فى اى مدينة يقع برج بيزا المائل","ما هي عاصمة الارجنتين","ما اسم المذبحة التي قتل فيها محمد علي خصومه من المماليك عام ١٨١١؟","في عهد اي حاكم مصري تم إنشاء المعاهد المختلطة؟","من هو مؤلف رواية ارض النفاق","من هو مؤلف كتاب حديث الأربعاء","ما هو لون دم الأخطبوط؟","ما هو العضو المسئول عن افراز العصارة الصفراوية في جسم الإنسان؟"],
    ["ما لون النجمة فى علم المغرب","ما لون النجمة فى علم تونس","دعا اخناتون لعبادة إله واحد فمن هو؟","كيف مات هيتلر؟","من هو مؤلف كتاب لن اعيش في جلباب ابي","من هو الكاتب العالمي قائل هذه الحكمة`  الفن مرآة تعكس الطبيعة`","تستخدم مطرقة شميدت لقياس ............  ؟","ما هو الغشاء الذي يحيط بالرئتين؟"],
    ["ما اللغة الرسمية فى اثيوبيا","	ما اصغر المحافظات المصرية من حيث المساحة","في اي عقد من القرن التاسع عشر اغتيل الرئيس الأمريكي ابراهام لينكون؟","ما هي الدولة التي نالت جزر البهاما استقلالها عنها عام ١٩٧٣؟","من هو مؤلف رواية ارض زيكولا","من هو قائل العبارة التالية قد اعذر من انذر","كم عدد الجيوب الأنفية في جسم الإنسان؟","ما هو الرمز الكيميائي لليود؟"],
    ["ما نظام الحكم فى نيجيريا","	ما عدد الوان علم لبنان","الي اي حضارة تنتمي الاله هيكات ( Hecate) ؟","من هو رئيس أركان حرب القوات المسلحة المصرية أثناء حرب أكتوبر ١٩٧٣؟","من هي المؤلفة الانجليزية الأمريكية صاحبة ال ٦٦ رواية بوليسية","من قائل العبارة الآتية`   يا اعدل الناس إلا في معاملتي فيك الخصام و انت الخصم و الحكم`","ما هو الرمز الكيميائي لعنصر الزركونيوم؟","ما هو علم دراسة وظائف الأعضاء و الأجهزة الحيوية؟"],
    ["في اي دولة يقع جبل الرحمة؟","ما اسم القارة التي تقع بين محيطين و يقسمهل مدار الجدي قسميين متساويين؟","من هو الفارس الملقب بسيف الله المسلول؟","كم عام استمر الاستعمار الفرنسي للجزائر؟","من هو مؤلف مسرحية اهل الكهف","مؤلف مصري الف اكثر من ٥٠ عمل بصريا و سمعيا من ضمنها قوة التفكير فمن هو","ما هو لون كرات الدم البيضاء؟","عن ماذا تعبر وحدة القياس RPM"],
    ["في اي محيط يصب نهر اليانغستي الموجود في الصين؟","علي اي مدار تتعامد الشمس في فصل الصيف شمالا؟","من هو القائد الفرنسي الذي خلف نابليون علي مصر؟","ما هو منصب عدلي منصور قبل توليه الحكم في الفترة الاتتقالية؟","من هو مؤلف رواية A tale of two cities ","من قائل العبارة الآتية`  بين منطوق لم يقصد و مقصود لم ينطق تضيع الكثير من المحبة` ","ما هما العضوان الوحيدان فى الانسان اللذان لا يتوقفان عن النمو؟","ما الاسم العلمي لمرض انيميا البحر المتوسط؟"],
    ["في اي دولة من دول أمريكا الشمالية يقع خليج غوانتانامو؟","مضيق دوفر يفصل دولة معينة عن باقي أوروبا فما هي هذه الدولة؟","ما هي الدولة التي استطاعت ان تحصل علي مقعد دائم بمجلس الأمن بفضل عدد سكانها؟","في اي عقد من القرن العشرين تم التوقبع على اتفاقية الجلاء البريطاني عن مصر؟","من قائل العبارة الآتية ` اليوم خمر و غدا امر`","ما هي جنسية الأديب باولو كويلو","ما هو العدد الذري للبوتاسيوم؟","ما هو الرمز الكيميائي لبروميد الصوديوم؟"],
    ["مضيق البوسفور يفصل بين قارة اسيا و قارة اخري فما هي؟","ما هي الدولة الافريقية المحاطة بدولة جنوب أفريقيا من كل الجهات؟","من هو الملك الذي قام بتشييد حدائق بابل المعلقة؟","من هو مؤسس إمبراطورية المغول؟","من هو مؤلف مسرحية اللحظة الحرجة التي كانت تجسد كفاح الشعب المصري ضد العدوان الثلاثي لعام 56","من قائل العبارة الاتية ` اني اري رؤوسا قد اينعت و حان قطافها `","Botanica لأي علم يشير هذا الاسم اللاتيني ","ما هي الصيغة الكيميائية لمعدن الغرافيت؟"],
    ["ما هي الدولة الافريقية التي عاصمتها ابوجا","ما هي الدولة العربية الاكثر انتاجا للحديد","في اي عام توحدت ألمانيا الشرقية و الغربية في دولة واحدة؟","في عهد اي حاكم مصري بدأ بناء خط السكة الحديد بين القاهرة و الإسكندرية؟","من قائل العبارة الاتية ` العدل جنة المظلوم و جحيم الظالم`","ما هو الكتاب الذي الفه ابن مالك و الذي يضم اغلب قواعد النحو و الصرف في منظومة شعرية","ما هو ثالث اكتر الغازات شيوعا في الغلاف الجوي؟","من هو العالم العربي الذي تمكن من قياس محيط الكرة الأرضية؟"],
    ["ما هي أطول سلسلة جبال في أمريكا الشمالية؟","في اي دولة يقع نهر اللوار","كم عام استمر حكم الملك فاروق لمصر؟","من هو الحاكم المصري الذي ساعد الانجليز علي احتلال مصر عام ١٨٨٢؟","من هو مؤلف مسرحية هنري الخامس ( Henry the fifth )","من هو الأديب العربي الذي نال جائزة نوبل للآداب عام 1988م","ما هو المعدن الرئيسي لمركب الكلوروفيل؟","ما هو أثقل الغازات في الجدول الدوري؟"],
    ["ما اسم المضيق الذي يقع بين البحر المتوسط و المحيط الاطلنطي؟","ما هي النسبة المئوية التي تشغلها الصحراء الشرقية من مساحة مصر؟","من هو عالم الآثار الانجليزي مكتشف مقبرة توت عنخ امون ؟","من هو عالم الآثار الانجليزي مكتشف مقبرة توت عنخ امون ؟","من هو الشاعر الذي ترجم رباعيات الخيام للغه العربية","كم يبلغ عدد بحور الشعر العربي","في اي مجال حصل الامريكي ريتشارد فاينمن على جائزة نوبل في 1965","ما هو الفيتامين الذي يتسبب نقصه في جفاف العين بخلاف فيتامين د"],
    ["ما المدينة التي اتخذها الهكسوس عاصمة لهم في مصر؟","اي الدول الاوروبية تسمي ببلاد الأودية السبعة؟","من هو زعيم الحركة الوطنية الذي توفي عام ١٩٠٨ في مصر؟","`اننا لن نورث و لن نستعبد بعد اليوم`   من قائل العبارة السابقة؟","من رائد إحياء الشعر العربي في العصر الحديث","من هو الفيلسوف الذي كان تلميذا لسقراط","في اي مجال حصلت روزالين يالو على جائزة نوبل ","السديم هي اجرام سماوية تتكون من غاز متخلخل من الهيدروجين و غاز اخر فما هو"],
    ["في اي دولة أوروبية تقع جزيرة باروس؟","في اي دولة عربية يقع جبل شمر","ما هو النصب التذكاري الذي أقامه اهل الإسكندرية تخليدا الامبراطور دقلديانوس؟","ما هي اول دولة أعطت النساء الحق في التصويت؟","من مؤلف رواية البؤساء","من صاحب كتاب تحرير المرأة","ما هو العدد الذري لعنصر الكوبالت؟","ما هو الرمز الكيميائي لعنصر السكانديوم؟"],
    ["ما هي أكبر مدينة أوروبية من حيث المساحة؟","ما هو ثاني اكبر محيطات العالم؟","ما هي سلسلة الصراعات الدامية التي مزقت أوروبا بين عامي ١٦١٨ و ١٦٤٨؟","من هو اول رئيس جمهورية يرئس مصر؟","من أهم دواوينه الداول والخمائل فمن هو","من هو الشاعر المصري الذي كتب قصيدة ` ايها القائمون`","ما هو الحمض الذي يتسبب في إجهاد العضلات؟","ما هي أقرب مجرة حلزونية لمجرة درب التبانة؟"],
    ["ما اسم الهضبة التي يُنبع منها نهر اليانغستي","","","","ما معني اسم البحتري الذي اشتهر به الشاعر الوليد بن عبيد الطائي في العصر العباسي","من هي الاديبة اللبنانية الراحلة مؤلفة رواية ظلمات و اشعة","من هو العالم الألماني الذي وضع نظرية الكم او ال quantum theory؟","أين توجد الغدة الصنوبرية (pineal gland) في جسم الإنسان؟"],
    ["","","","","ما هي جنسية الاديب العالمي صموئيل بيكيت و الذي حصل علي جائزة نوبل عام 1969","من الذي كتب النشيد الوطني بلادي بلادي بعد تأثره بكلمات مصطفي كامل","ما هو الرمز الكيميائي لليورانيوم؟","كم عدد عناصر الدورة الثانية في الجدول الدوري؟"],

    /*
    * 5  georaphy
    * 15 tari5
    * 17 adab
    * 10 3loom
    * */


  ];
  List<List<String>> answers=[
   /* ,["مدينة سان مارينو","استراليا","كتبغا","الخديوي توفيق","فيكتور هوجو","علاء الاسواني","النيتروجين","1"]*/
    /*["افريقيا","اسوان","عمرو بن العاص","الجزائر","مصطفى صادق الرافعي","عباس محمود العقاد","3","CH4"],*/
    ["اسيا","360","الثالث","فريزر","المتنبي","نجيب محفوظ","فيتامين D","الكلية"],
    ["مدينة بيزا","بوينس ايريس","مذبحة القلعة","الخديوي اسماعيل","يوسف السباعي","طه حسين","ازرق","الكبد"],
    ["اخضر","احمر","اتون ( إله الشمس) ","منتحرا","احسان عبد القدوس","ويليام شكسبير","قياس صلابة الخرسانة","الغشاء البلوري"],
    ["الامهرية","دمياط","العقد السابع","المملكة المتحدة","عمرو عبد الحميد","معاوية ابن ابي سفيان","8","I"],
    ["جمهوري","3","الحضارة الاغريقية ( اليونانية)","الفريق سعد الدين الشاذلي","اجاثا كريستي","المتنبي","Zr","علم الفسيولوجي"],
    ["السعودية","استراليا","خالد بن الوليد","١٣٢ سنة","توفيق الحكيم","ابراهيم الفقي","لا يوجد لها لون","سرعة الدوران (Revolution Per Minute)"],
    ["المحيط الهادي","مدار السرطان","كليبر","رئيس المحكمة الدستورية العليا","تشارلز ديكنز","جبران خليل جبران","الأنف و الأذن","الثلاسيميا"],
    ["كوبا","بريطانيا","الصين","العقد السادس","امرؤ القيس","برازيلي","19","NaBr"],
    ["اوروبا","ليسوتو","الملك نبوخذ نصر","جنكيز خان","يوسف ادريس","الحجاج بن يوسف الثقفي","علم النبات","C"],
    ["نيجيريا","موريتانيا","1990","الخديوي عباس الاول","عمر ابن الخطاب","الفية ابن مالك","الارجون","ابو الريحان البيروني"],
    ["جبال روكي","فرنسا","١٦ سنة","الخديوي توفيق","ويليام شكسبير","نجيب محفوظ","المغنيسيوم","الرادون"],
    ["جيل طارق","22 %","هوارد كارتر","٢٠ سنة","احمد رامي","16","الفيزياء","فيتامين ا"],
    ["اواريس","ارمينيا","مصطفي كامل","احمد عرابي","محمود سامي البارودي","افلاطون","الطب","الهيليام"],
    ["اليونان","السعودية","عمود السواري","نيوزيلاندا","فيكتور هوجو","قاسم امين","27","Sc"],
    ["باريس","المحيط الاطلنطي","حرب ال ٣٠ عام","محمد نجيب","ايليا ابو ماضي","حافظ ابراهيم","حمض اللاكتيك","اندروميدا او المرأة المسلسلة"],
    ["هضبة التبت","","","","قصير القامة","مي زيادة","ماكس بلانك","المخيخ او الدماغ"],
    ["","","","","ايرلاندي","يونس القاضي","U","8"],
  ];
}



/*
*
*
*
* */