class Data_gawalat{
  List<String> titles=["الجولة الاولى","الجولة الثانية","الجولة االثالثة","الجولة الرابعة","الجولة الخامسة"];
  List<String> names=["صد رد","ماراثون","النيشان","تحت الضغط","عجلة الحظ"];
  List<String> details=[
    '''4 اسئله لكل فريق
كل سؤال 10 درجات
يمكنك استخدام الجوكر مره واحده 
    ليصبح السؤال بـ 20 درجه
''',
    '''4 اسئله سرعه لواحد من كل فريق
كل سؤال 10 درجات
''',
    '''
    
''',
    '''
    واحد من كل سيجاوب على 9 
    اسئلة بينما الاخر غير موجود
''',
    '''
'''
  ];

}