class Luck_Wheel_Data{
  List<Map<String,List<String>>> questions=[
          /*{
            "علوم":["ما الغاز الناتج من تفاعل الحديد مع حمض الهيدروكلوريك؟","من مخترع المصباح الكهربائي؟","ما الدولة التي اكتشفت البارود؟",],
            "ديني مدروس":["كم عدد رسائل الكاثوليكون؟","كم عدد اصحاحات انجيل مرقص؟","ما هي المدة التي قضاها المسيح في مصر؟",],
            "قدرات ذهنية":["95*3+35*4 ","6!","",],
            "جغرافيا":["فى اى دولة يقع نهر السين؟","ما هي عاصمة النمسا؟","",],
            "رياضة":["ما جنسية اللاعب راداميل فالكاو؟","ما هو النادي الاكثر حصولا على champions league","من مخترع الكمبيوتر؟",],
          },*/

    /*{
      "قدرات ذهنية":["15×5+5÷5×50","990÷30+25×8"],
      "سفر القضاة":["من هو اول قاضي علي بني إسرائيل؟","سر قوة شمشون الجبار كان في... ؟"],
      "رياضة":["الترقية في لعبة الشطرنج هي حركة تحدث عندما تصل قطعة معينة للرقعة الأخيرة من القسم الخاص بالخصم فما هي هذه القطعة؟","في كرة السلة يوجد قيمتين مختلفتين عند احراز الهدف علي حسب مكان تنفيذ التسديدة فما هما؟"],
      "جغرافيا":["تعد جميع الدول العربية و الافريقية مدنا ساحلية عدا القاهرة و عاصمة اخري فما هي؟","	تمتد سلسلة جبال البلقان في بلغاريا و دولة أوروبية اخري فما هي؟"],
      "علوم":["ما هو العدد الذري لعنصر الجادولينيوم؟","من هو الطبيب العباسي الملقب بجالينوس العرب و مؤلف كتاب سر الأسرار في الطب و الكيمياء؟"],
    },*/

    {
      "قدرات ذهنية":["5*99*2","15*5*5","57/3+72/6","110-56-34 "],
      "سفر القضاة":["قال الرب ليهوذا ان يصعد لمحاربة الكنعانيين لكن يهوذا رفض ان يذهب بمفرده و دعا سبط اخر ان يذهب معه فمن هو هذا السبط؟ (قض ١)","من هي التي قتلت سيسرا رئيس جيش الملك يابين؟ (قض ٤)","من قائل العبارة التالية ` اه يا ابنتي قد احزنتني حزنا و صرت بين مكدري لأني قد فتحت فمي الي الرب ولا يمكنني الرجوع`؟ (قض ١١)","لمن قال جدعون ` عند رجوعي بسلام اهدم هذا البرج`؟ (قض ٨)"],
      "رياضة":["ما هو أكبر ملعب (ستاد) في الوطن العربي؟"," من هو اللاعب الالماني الاكثر مشاركة في مباريات كاس العالم لكرة القدم؟","ما الرياضة التي تألق فيها اللاعب ايرفين ماجيك جونسون؟"],
      "جغرافيا":["	ما عدد طوابق برج بيزا المائل","	فى اى دولة يقع قصر الحمراء","في اي قارة يقع جبل مونت بلانك؟"],
      "علوم":["من كم عظمة يتكون هيكل سمكة القرش","ما هو المركب شبه القلوي السام الذي يستخرج من أوراق التبغ و يستخدم في أغلب المبيدات الحشرية","كم عدد كرموسومات لدي الاناث؟"],
    },
    {
      "قدرات ذهنية":["49*50/7","55*3+123/3","7*3*6*5","115/5+28*3"],
      "سفر القضاة":["تعترف الكنيسة بأن كاتب سفر القضاه هو... ؟","من هو رئيس جيش الملك يابين ملك كنعان؟ (قض ٤)","من الذين قالوا لجدعون لماذا لم تاخذنا معك لمحاربة المديانيين و خاصموه حينها؟ (قض ٨)","صارت عادة لبنات إسرائيل ان يذهبن من سنة الي سنة لينحن علي بنت يفتاح الجلعادي فكم يوم غي السنة يذهبوا؟ (قض ١١)"],
      "رياضة":["ما هو الفريق المصري الذي تمكن من الصعود لدور المجموعات في كاس الكونفدرالية الافريقية لكرة القدم عام ٢٠١٧؟","ما هو اقدم اتحاد كرة قدم في العالم و أسس عام ١٨٦٣؟","ما النادي الذي اشتري منه ريال مدريد اللاعب سيرجيو راموس؟"],
      "جغرافيا":["ما نظام الحكم فى فيتنام","(حُماةَ الدّيار عليكمْ سلام) هو نشيد وطنى لاحد الدول فما هي","في اي محيط يقع مثلث برمودا؟"],
      "علوم":["ما هو الرمز الكيميائي لعنصر الراديوم؟","ما هي الغدد التي تقوم بتصفية و تطهير الدم؟","ما هي وحدة قياس التردد؟"],
    },
    {
      "قدرات ذهنية":["98+97+96+95","62*6-62*4","16*5-78","23*4+25*4"],
      "سفر القضاة":["كم عدد الذين بقوا مع زبح و صلمناع (المديانيين) من جميع جيش بني المشرق؟ (قض ٨)","كم سنة دفع فيها الرب إسرائيل ليد مديان؟ (قض ٦)","قال الرب لجدعون ان الشعب الذي ستحاربه لا يحتاج عدد كبير من الجييش فمن هو هذا الشعب الذي تكلم عنه الرب؟ (قض 7)"," من أين صعدوا بنو القيني حمي موسى مع بني يهوذا الي برية يهوذا؟ (قض ١)"],
      "رياضة":["ما اسم سباق العدو الذي تصل مسافته لحوالي ٤٢ كم؟","من هو اول فريق فاز بالدوري المصري لكرة القدم موسم ١٩٤٨ - ١٩٤٩؟","كم عدد جولات الملاكمة للرجال في دورة الألعاب الاوليمبية؟"],
      "جغرافيا":["ما عدد الامارات العربية المتحدة","كم مقعد لقارة افريقيا فى مجلس الامن","في اي دولة اسيويه يقع نهر تويوهيرا؟"],
      "علوم":["اي الكواكب لديه اكبر عدد معروف من الأقمار؟","ما هو الاسم العلمي للمياه الزرقاء في العين؟","تريتون هو الهرم الأكبر لأي كوكب؟"],
    },
    {
      "قدرات ذهنية":["15*6-16*5","99*9-3*7*3/63","29*3+112","1*2*3*4*5"],
      "سفر القضاة":["سئل شعب بني إسرائيل في أول سفر القضاه عن هوية الذي سيحارب شعب معين فمن هو هذا الشعب؟","من كان اكثر القضاه أبناء؟ ( قض ٨)","ما الذي كان مميزا في عجلون ملك مؤاب؟ (قض ٣)","ما الأداة التي قتلت بها ياعيل سيسرا؟ (قض ٤)"],
      "رياضة":[" من هي اللاعبة التي فازت ببطولة العالم للاسكواش عام ٢٠١٧؟","ما هو أفضل مركز حققه المنتخب المصري لكرة القدم في التصنيف الدولي حتي الآن؟","من هو هداف بطولة امم افريقيا عام ٢٠١٠؟","ما هو أكبر ملعب (ستاد) في الوطن العربي؟"],
      "جغرافيا":["ما عاصمة كوريا الشمالية","ما اللغة الرسمية للنمسا","في اي دولة لاتينية يقع مضيق لاجلان الي جانب الارجنتين؟","فى اى دولة يقع قصر الحمراء"],
      "علوم":["في اي عضو من أعضاء جسم الإنسان توجد الخلية بيتا؟","ما هو علم الانتومولوجيا؟","في اي عام حصل العالم احمد زويل علي جائزة نوبل في الكيمياء؟","ما هو المركب شبه القلوي السام الذي يستخرج من أوراق التبغ و يستخدم في أغلب المبيدات الحشرية"],
    },
    {
      "قدرات ذهنية":["100-65+100-34*2","14*4-7*4-7*2","9*9+11*11","85+58-36- 63"],
      "سفر القضاة":["كم عدد القضاه المذكورين في سفر القضاه؟","من هو القاضي الذي حياه ملاك الرب قائلا السلام لك يا جبار البأس؟ ( قض ٦)","من قائل العبارة التالية ` لا يكون لك فخر في الطريق التي انت سائر فيها لأن الرب يبيع سيسرا بيد امرأة`؟ (قض ٤)","قال الرب لجدعون ان الشعب الذي ستحاربه لا يحتاج عدد كبير من الجييش فمن هو هذا الشعب الذي تكلم عنه الرب؟ (قض 7)"],
      "رياضة":["ما هو المنتخب الذي تلقي اكبر هزيمة في تاريخ كاس العالم لكرة القدم عام ١٩٨٢؟","من هو اللاعب الكولومبي الذي احرز هدفا بالخطأ في مرماه في كاس العالم لكرة القدم عام ١٩٩٤ و تسبب في وفاته فيما بعد؟ ","من هو اللاعب الذي أحرز الهدف الوحيد في نهائي بطولة امم افريقيا عام ٢٠٠٨؟"," من هو اللاعب الالماني الاكثر مشاركة في مباريات كاس العالم لكرة القدم؟"],
      "جغرافيا":["ما عدد النجوم فى علم استراليا","ما هى عاصمة تركيا","ما هي عاصمة اليونان؟","ما نظام الحكم فى فيتنام"],
      "علوم":["ما هو العدد الذري لعنصر الكوبرنيسيوم ؟","ما هو البروتين الموجود في خلايا الدم الحمراء و الذي بنقل الاكسجين من الرئتين الأنسجة؟","من هو العالم و الطبيب الفارسي الذي عرف بشيخ و أمير الاطباء و ابو الطب الحديث؟","كم عدد كرموسومات لدي الاناث؟"],
    },
    {
      "قدرات ذهنية":["13*3+130*3","31+13+31-14","273/3+27/3","56+96-103"],
      "سفر القضاة":["من هي التي قتلت سيسرا رئيس جيش الملك يابين؟ (قض ٤)","من قائل العبارة التالية ` اه يا ابنتي قد احزنتني حزنا و صرت بين مكدري لأني قد فتحت فمي الي الرب ولا يمكنني الرجوع`؟ (قض ١١)","لمن قال جدعون ` عند رجوعي بسلام اهدم هذا البرج`؟ (قض ٨)","اهود بن جيرا كان من اي سبط؟ (قض ٣)"],
      "رياضة":["ما هي اللعبة التي حقق فيها البطل المصري هشام مصباح الميدالية البرونزية الوحيدة لمصر عام ٢٠٠٨؟","كم عدد المرات التي نظمت فيها مصر كاس العالم لكرة اليد للرجال؟","ما الرياضة التي تألق فيها اللاعب ايرفين ماجيك جونسون؟","ما اسم سباق العدو الذي تصل مسافته لحوالي ٤٢ كم؟"],
      "جغرافيا":["فى اي دولة تقع جامعة كامبريدج","	ما هى ثانى اعلى قمة فى العالم","في اي محيط يقع مثلث برمودا؟","ما عدد الامارات العربية المتحدة"],
      "علوم":["ما هو الاسم الكيميائي لصودا الغسيل؟","ما هو أكبر عضو داخلي في الجسم البشري؟","ما هو الرمز الكيميائي لعنصر الراديوم؟","ما هي الغدد التي تقوم بتصفية و تطهير الدم؟"],
    },
    {
      "قدرات ذهنية":["15*5*5","57/3+72/6","110-56-34 ","29*3+112"],
      "سفر القضاة":["كم عدد الذين بقوا مع زبح و صلمناع (المديانيين) من جميع جيش بني المشرق؟ (قض ٨)","قال الرب لجدعون ان الشعب الذي ستحاربه لا يحتاج عدد كبير من الجييش فمن هو هذا الشعب الذي تكلم عنه الرب؟ (قض 7)"," من أين صعدوا بنو القيني حمي موسى مع بني يهوذا الي برية يهوذا؟ (قض ١)","سئل شعب بني إسرائيل في أول سفر القضاه عن هوية الذي سيحارب شعب معين فمن هو هذا الشعب؟"],
      "رياضة":["ما هو المنتخب الافريقي الوحيد الفائز بكأس العالم للشباب في كرة القدم؟","ما هو الفريق الذي فاز بالدوري الإيطالي لكرة القدم ٦ مرات متتالية؟","من هو اول فريق فاز بالدوري المصري لكرة القدم موسم ١٩٤٨ - ١٩٤٩؟","كم عدد جولات الملاكمة للرجال في دورة الألعاب الاوليمبية؟"],
      "جغرافيا":["على ماذا تدل الدائرة الحمراء فى علم اليابان","فى اي دولة بدا تاسيس قناة سبيس تون","كم مقعد لقارة افريقيا فى مجلس الامن","في اي قارة يقع جبل مونت بلانك؟"],
      "علوم":["ما هي قيمة pH المحلول الحمضي؟","ما هو علم الايكولوجيا؟","ما هي وحدة قياس التردد؟","اي الكواكب لديه اكبر عدد معروف من الأقمار؟"],
    },
    {
      "قدرات ذهنية":["49*50/7","55*3+123/3","7*3*6*5","115/5+28*3"],
      "سفر القضاة":["تعترف الكنيسة بأن كاتب سفر القضاه هو... ؟","من هو رئيس جيش الملك يابين ملك كنعان؟ (قض ٤)","من الذين قالوا لجدعون لماذا لم تاخذنا معك لمحاربة المديانيين و خاصموه حينها؟ (قض ٨)","صارت عادة لبنات إسرائيل ان يذهبن من سنة الي سنة لينحن علي بنت يفتاح الجلعادي فكم يوم غي السنة يذهبوا؟ (قض ١١)"],
      "رياضة":["من هو المدرب المصري الوحيد الذي صعد بمنتخب مصر لكأس العالم لكرة القدم؟ ","من هو اللاعب الوحيد الذي فاز مع منتخبه بكأس العالم لكرة القدم ٣ مرات؟","ما هو أفضل مركز حققه المنتخب المصري لكرة القدم في التصنيف الدولي حتي الآن؟","من هو هداف بطولة امم افريقيا عام ٢٠١٠؟"],
      "جغرافيا":["ما عاصمة كوريا الشمالية","ما اللغة الرسمية للنمسا","في اي دولة لاتينية يقع مضيق لاجلان الي جانب الارجنتين؟","فى اى دولة يقع قصر الحمراء"],
      "علوم":["تريتون هو الهرم الأكبر لأي كوكب؟","ما هو علم الانتومولوجيا؟","في اي عام حصل العالم احمد زويل علي جائزة نوبل في الكيمياء؟","ما هو المركب شبه القلوي السام الذي يستخرج من أوراق التبغ و يستخدم في أغلب المبيدات الحشرية"],
    },
    {
      "قدرات ذهنية":["98+97+96+95","16*5-78","23*4+25*4","1*2*3*4*5"],
      "سفر القضاة":["من كان اكثر القضاه أبناء؟ ( قض ٨)","ما الذي كان مميزا في عجلون ملك مؤاب؟ (قض ٣)","ما الأداة التي قتلت بها ياعيل سيسرا؟ (قض ٤)","كم عدد القضاه المذكورين في سفر القضاه؟"],
      "رياضة":["ما هو المنتخب الذي فاز بكأس العالم لكرة القدم عام ٢٠٠٢؟","كم مرة ألغيت بطولة كأس العالم لكرة القدم منذ انطلاقها؟","ما هو أكبر ملعب (ستاد) في الوطن العربي؟","ما هو المنتخب الذي تلقي اكبر هزيمة في تاريخ كاس العالم لكرة القدم عام ١٩٨٢؟"],
      "جغرافيا":["سان مارينو دولة أوروبية ثغيرة محاطة بالكامل بإحدى الدول فما هي؟","في اي دولة تقع غابة الأمازون","في اي ولاية أمريكية تقع لونج ايلاند؟","ما هو الاسم القديم للبحر الأسود"],
      "علوم":["ما هو العدد الذري لعنصر الارجون؟","أين توجد عظمة الشظية في جسم الإنسان؟","مرض يصيب الشرايين فيفقدها ليونتها و مرونتها لتراكم الترسبات الدهنية عليها فما اسمه؟","الي كم نوع تنقسم الصخور حسب نشأتها؟"],
    },
    {
      "قدرات ذهنية":["68*5+42*2","27*3+27*2","55*99/45+12*12","69/3+144/9"],
      "سفر القضاة":["من هو القاضي الذي حياه ملاك الرب قائلا السلام لك يا جبار البأس؟ ( قض ٦)","من قائل العبارة التالية ` لا يكون لك فخر في الطريق التي انت سائر فيها لأن الرب يبيع سيسرا بيد امرأة`؟ (قض ٤)","قال الرب لجدعون ان الشعب الذي ستحاربه لا يحتاج عدد كبير من الجييش فمن هو هذا الشعب الذي تكلم عنه الرب؟ (قض 7)","ماذا كان اسم اله بني عمون؟ (قض ١١)"],
      "رياضة":["من هو اول لاعب مصري في التاريخ يفوز بلقب كاس الإتحاد الانجليزي؟","ما هو منتخب كره القدم الملقب بالديوك؟","من هو اللاعب الكولومبي الذي احرز هدفا بالخطأ في مرماه في كاس العالم لكرة القدم عام ١٩٩٤ و تسبب في وفاته فيما بعد؟ ","من هو اللاعب الذي أحرز الهدف الوحيد في نهائي بطولة امم افريقيا عام ٢٠٠٨؟"],
      "جغرافيا":["في اي محافظة مصرية يصل وادي النيل الي أقصي اتساع له","ما هي عاصمة الاردن","ما هي ثاني اكبر بحيرة طبيعية في مصر من حيث المساحة؟","في اي دول أمريكا الجنوبية تقع مدينة ماتشو بيتشو؟"],
      "علوم":["تجمع كوني ذو جاذبية هائلة و له القدرة علي سحب اي شئ حوله حتى الضوء فما هو؟","أين يوجد جسر فارول في جسم الإنسان؟","ما هو العدد الذري لعنصر الكبريت؟","ما هو العدد الذري لعنصر التيتانيوم؟"],
    },

    {
      "قدرات ذهنية":["9*9+11*11","85+58-36-63","31+13+31-14","273/3+27/3"],
      "سفر القضاة":["من قائل العبارة التالية ` اه يا ابنتي قد احزنتني حزنا و صرت بين مكدري لأني قد فتحت فمي الي الرب ولا يمكنني الرجوع`؟ (قض ١١)","لمن قال جدعون ` عند رجوعي بسلام اهدم هذا البرج`؟ (قض ٨)","اهود بن جيرا كان من اي سبط؟ (قض ٣)","قال الرب لجدعون ان الشعب الذي ستحاربه لا يحتاج عدد كبير من الجييش فمن هو هذا الشعب الذي تكلم عنه الرب؟ (قض 7)",],
      "رياضة":["في اي لعبة اشتهر الرياضي المصري علاء الدين ابو قاسم؟","من هو المدير الفني الذي بدأ الموسم الكروي ٢٠١٧-٢٠١٨ مع نادي الزمالك؟"," من هو اللاعب الالماني الاكثر مشاركة في مباريات كاس العالم لكرة القدم؟","ما هو اكثر المنتخبات الاكثر تتويجا بلقب بطولة الدوري العالمي بكرة الطايرة؟"],
      "جغرافيا":["ما هى عاصمة تركيا","ما هي عاصمة اليونان؟","ما نظام الحكم فى فيتنام"],
      "علوم":["ما هو البروتين الموجود في خلايا الدم الحمراء و الذي بنقل الاكسجين من الرئتين الأنسجة؟","من هو العالم و الطبيب الفارسي الذي عرف بشيخ و أمير الاطباء و ابو الطب الحديث؟","كم عدد كرموسومات لدي الاناث؟","ما هو العنصر الكيميائي للفضة؟"],
    },

    {
      "قدرات ذهنية":["56+96-103","110-56-34 ","29*3+112","111+222+333+444"],
      "سفر القضاة":[" من أين صعدوا بنو القيني حمي موسى مع بني يهوذا الي برية يهوذا؟ (قض ١)","سئل شعب بني إسرائيل في أول سفر القضاه عن هوية الذي سيحارب شعب معين فمن هو هذا الشعب؟","كم عدد الفرق التي تقسمت اليها ال 300 رجل في الحرب مع المديانيين؟ ( قض 7)","بعد موت عثنئيل بن قناز من الملك الذي شدده الرب علي إسرائيل ؟ (قض ٣)"],
      "رياضة":["من هو المنتخب الافريقي الملقب بالنسور؟","ما هو الفريق الفائز بكأس الكونفدرالية لكرة القدم عام ٢٠١٦؟","كم عدد المرات التي نظمت فيها مصر كاس العالم لكرة اليد للرجال؟","ما الرياضة التي تألق فيها اللاعب ايرفين ماجيك جونسون؟"],
      "جغرافيا":["في اي محيط يقع مثلث برمودا؟","ما عدد الامارات العربية المتحدة","ما هو الاسم الذي يطلق على الجزر العديدة المتقاربة","كم عدد المحيطات التي تحد الولايات المتحدة"],
      "علوم":["ما هو الاسم الكيميائي لصودا الغسيل؟","ما هو أكبر عضو داخلي في الجسم البشري؟","ما هو الرمز الكيميائي لعنصر الراديوم؟","ما هي الغدد التي تقوم بتصفية و تطهير الدم؟"],
    },

    {
      "قدرات ذهنية":["49*50/7","55*3+123/3","7*3*6*5","115/5+28*3"],
      "سفر القضاة":["من هو رئيس جيش الملك يابين ملك كنعان؟ (قض ٤)","من الذين قالوا لجدعون لماذا لم تاخذنا معك لمحاربة المديانيين و خاصموه حينها؟ (قض ٨)","صارت عادة لبنات إسرائيل ان يذهبن من سنة الي سنة لينحن علي بنت يفتاح الجلعادي فكم يوم غي السنة يذهبوا؟ (قض ١١)","ما اسم حبرون قبل ان يأخذها اليهود و يسموها بهذا الاسم؟ ( قض ١)"],
      "رياضة":["من هو اول ثنائي متزوج في تاريخ الرياضة يفوز بلقبي أمريكا المفتوحة للاسكواش عام ٢٠١٧ و في نفس اليوم؟","أين عقدت بطولة العالم لكرة اليد للرجال عام ٢٠٢١؟","ما اسم سباق العدو الذي تصل مسافته لحوالي ٤٢ كم؟","من هو اللاعب الوحيد الذي فاز مع منتخبه بكأس العالم لكرة القدم ٣ مرات؟"],
      "جغرافيا":["على ماذا تدل الدائرة الحمراء فى علم اليابان","فى اي دولة بدا تاسيس قناة سبيس تون","كم مقعد لقارة افريقيا فى مجلس الامن","في اي قارة يقع جبل مونت بلانك؟"],
      "علوم":["ما هو علم الايكولوجيا؟","ما هي وحدة قياس التردد؟","اي الكواكب لديه اكبر عدد معروف من الأقمار؟","ما هو العنصر الكيميائي للدهب؟"],
    },


    {
      "قدرات ذهنية":["",""],
      "سفر القضاة":["ما هو أفضل مركز حققه المنتخب المصري لكرة القدم في التصنيف الدولي حتي الآن؟","من هو هداف بطولة امم افريقيا عام ٢٠١٠؟"],
      "رياضة":["ما هو اخر فريق فاز بكأس السوبر الاوروبي بعدما فاز بكأس الدوري الأوروبي متغلبا على بطل دوري أبطال أوروبا ريال مدريد عام ٢٠١٨؟","ما هو المنتخب الذي خسر المبارة النهائية في بطولة اليورو عام ٢٠١٢ (الوصيف)؟","ما هو المنتخب الافريقي الوحيد الفائز بكأس العالم للشباب في كرة القدم؟","ما هو الفريق الذي فاز بالدوري الإيطالي لكرة القدم ٦ مرات متتالية؟"],
      "جغرافيا":["ما عاصمة كوريا الشمالية","ما اللغة الرسمية للنمسا","في اي دولة لاتينية يقع مضيق لاجلان الي جانب الارجنتين؟","فى اى دولة يقع قصر الحمراء"],
      "علوم":["في اي عام حصل العالم احمد زويل علي جائزة نوبل في الكيمياء؟","ما هو المركب شبه القلوي السام الذي يستخرج من أوراق التبغ و يستخدم في أغلب المبيدات الحشرية","كم عدد الحجرات في معدة البقرة؟","الي ماذا ترمز الحروف nm في وحدات قياس الاطوال؟"],
    },
    {
      "قدرات ذهنية":["",""],
      "سفر القضاة":["",""],
      "رياضة":["من هو لاعب كرة القدم المصري الفائز بلقب الدوري الألماني موسم ٢٠١٠-٢٠١١؟","في اي بلد يقع مقر الاتحاد العالمي للتايكوندو؟","من هو اول فريق فاز بالدوري المصري لكرة القدم موسم ١٩٤٨ - ١٩٤٩؟","كم عدد جولات الملاكمة للرجال في دورة الألعاب الاوليمبية؟"],
      "جغرافيا":["",""],
      "علوم":["",""],
    },

    {
      "قدرات ذهنية":["",""],
      "سفر القضاة":["",""],
      "رياضة":["من هو صاحب فكرة كاس العالم؟","سان سيرو هو ستاد يتقاسمه ناديان فما هما؟"],
      "جغرافيا":["",""],
      "علوم":["",""],
    },
    {
      "قدرات ذهنية":["",""],
      "سفر القضاة":["",""],
      "رياضة":["من هو اللاعب الذي فاز بالكرة الذهبية عام ٢٠٠٥؟","من هو المدرب الانجليزي الذي فاز بدوري أبطال أوروبا لكرة القدم ٣ مرات؟"],
      "جغرافيا":["",""],
      "علوم":["",""],
    },
    {
      "قدرات ذهنية":["",""],
      "سفر القضاة":["",""],
      "رياضة":["في اي بطولة لعبت أطول مباراة تنس في التاريخ؟",""],
      "جغرافيا":["",""],
      "علوم":["",""],
    },




/*:جغرافيا
١- في اي قارة يقع جبل مونت بلانك؟
أوروبا
٢- في اي محيط يقع مثلث برمودا؟
الاطلنطي
٣- في اي دولة اسيويه يقع نهر تويوهيرا؟
اليابان
٤- في اي دولة لاتينية يقع مضيق لاجلان الي جانب الارجنتين؟
تشيلي
٥- ما هي عاصمة اليونان؟
اثينا

علوم :
١- كم عدد كرموسومات x لدي الاناث؟
٢
٢- ما هي وحدة قياس التردد؟

هرتز
٣- تريتون هو الهرم الأكبر لأي كوكب؟
نبتون
٤- في اي عام حصل العالم احمد زويل علي جائزة نوبل في الكيمياء؟
1999
٥- من هو العالم و الطبيب الفارسي الذي عرف بشيخ و أمير الاطباء و ابو الطب الحديث؟
ابن سينا

رياضة :
١- ما الرياضة التي تألق فيها اللاعب ايرفين ماجيك جونسون؟
كرة السلة
٢- ما النادي الذي اشتري منه ريال مدريد اللاعب سيرجيو راموس؟
اشبيليه
٣- كم عدد جولات الملاكمة للرجال في دورة الألعاب الاوليمبية؟
٣
٤- من هو هداف بطولة امم افريقيا عام ٢٠١٠؟
محمد ناجي جدو
٥- من هو اللاعب الذي أحرز الهدف الوحيد في نهائي بطولة امم افريقيا عام ٢٠٠٨؟
ابو تريكة

قدرات ذهنية :
١- كم تساوي ٨٪ من ١٠ مليون؟
800,000
٢- كم عدد الساعات في ٤ ايام؟
٩٦ ساعة
٣- كم دقيقة توجد في ٣ ساعات و ٢٤٠ ثانية؟
١٨٤
٤- حل المسألة الآتية :? = 11 - 22 + 33 ÷ 99
14
٥- حل المسألة الآتية :? = 8 × 8 ÷ 80 - 8 + 88
16*/


        ];

  List<Map<String,List<String>>> answers=[
    /*{
      "علوم":["هيدروجين","توماس اديسون","الصين",],
      "ديني مدروس":["7"," 16","ثلاث سنين و نصف",],
      "قدرات ذهنية":["425","720","نجيب محفوظ",],
      "جغرافيا":["فرنسا","فيينا","توماس اديسون",],
      "رياضة":["كولومبي","ريال مدريد","تشارلز بابيج",],
    },*/
    /*{
      "قدرات ذهنية":["125","233"],
      "سفر القضاة":["يشوع","شعره"],
      "رياضة":["العسكري","الهدف بنقطتين او ٣"],
      "جغرافيا":["الخرطوم","	صربيا"],
      "علوم":["64","ابو بكر الرازي"],
    },*/
    {
      "قدرات ذهنية":["990","375","31","20"],
      "سفر القضاة":["شمعون","ياعيل(امرأة حاجر)","يفتاح الجلعادي","اهل فنوئيل",],
      "رياضة":["برج العرب","لوثار ماتيوس","كرة السلة"],
      "جغرافيا":["8","اسبانيا","اوروبا"],
      "علوم":["لا يوجد","النيكوتين","2"],
    },
    {
      "قدرات ذهنية":["350","206","630","107"],
      "سفر القضاة":["صموئيل النبي","سيسرا","افرايم","اربع ايام"],
      "رياضة":["سموحة","الاتحاد الانجليزي","اشبيلية"],
      "جغرافيا":["جمهورى","سوريا","الاطلنطي"],
      "علوم":["Ra","الغدد الليمفاوية","هرتز"],
    },
    {
      "قدرات ذهنية":["386","124","2","192"],
      "سفر القضاة":["15000","سبع سنين","المديانيين","من مدينة النخل(اريحا)"],
      "رياضة":["ماراثون","الاهلي","3"],
      "جغرافيا":["7","3","اليابان"],
      "علوم":["المشتري( ٦٧ كوكب)","الجلوكوما","نبتون"],
    },
    {
      "قدرات ذهنية":["10","890","199","120"],
      "سفر القضاة":["الكنعانيين","جدعون","السمنة(كان سمينا جدا)","وتد الخيمة"],
      "رياضة":["نور الشربيني","التاسع","محمد ناجي جدو","برج العرب"],
      "جغرافيا":["بيونج يانج","الالمانية","تشيلي","اسبانيا"],
      "علوم":["البنكرياس","علم دراسة الحشرات","1999","النيكوتين"],
    },
    {
      "قدرات ذهنية":["67","14","202","44"],
      "سفر القضاة":["14","جدعون","دبورة النبية","المديانيين"],
      "رياضة":["السلفادور (١٠-١) ","اندريس اسكوبار ","ابو تريكة","لوثار ماتيوس"],
      "جغرافيا":["6","انقرة","اثينا","جمهورى"],
      "علوم":["112","الهيموجلوبين","ابن سينا","2"],
    },
    {
      "قدرات ذهنية":["429","61","100","49"],
      "سفر القضاة":["ياعيل(امرأة حاجر)","يفتاح الجلعادي","اهل فنوئيل","بنيامين"],
      "رياضة":["الجودو","مرة واحدة ","كرة السلة","ماراثون"],
      "جغرافيا":["انجلترا","كي تو","الاطلنطي","7"],
      "علوم":["كربونات الصوديوم ( sodium carbonate)","الكبد","Ra","الغدد الليمفاوية"],
    },
    {
      "قدرات ذهنية":["375","31","20","199"],
      "سفر القضاة":["15000","المديانيين","من مدينة النخل(اريحا)","الكنعانيين"],
      "رياضة":["غانا (٢٠٠٩)","يوفينتوس","الاهلي","3"],
      "جغرافيا":["الشمس","البحرين","3","اوروبا"],
      "علوم":["pH<7","علم البيئة","هرتز","المشتري( ٦٧ كوكب)"],
    },

    {
      "قدرات ذهنية":["350","206","630","107"],
      "سفر القضاة":["صموئيل النبي","سيسرا","افرايم","اربع ايام"],
      "رياضة":["محمود الجوهري","بيليه","التاسع","محمد ناجي جدو"],
      "جغرافيا":["بيونج يانج","الالمانية","تشيلي","اسبانيا"],
      "علوم":["نبتون","علم دراسة الحشرات","1999","النيكوتين"],
    },

    {
      "قدرات ذهنية":["386","2","192","120"],
      "سفر القضاة":["جدعون","السمنة(كان سمينا جدا)","وتد الخيمة","14"],
      "رياضة":["البرازيل","مرتين","برج العرب","السلفادور (١٠-١) "],
      "جغرافيا":["إيطاليا","البرازيل","نيويورك","بحر البنطس"],
      "علوم":["18","الساق","تصلب الشرايين","٣ ( نارية و رسوبية و متحولة)"],
    },
    {
      "قدرات ذهنية":["424","135","265","39"],
      "سفر القضاة":["جدعون","دبورة النبية","المديانيين","كموش"],
      "رياضة":["محمد النني","فرنسا","اندريس اسكوبار ","ابو تريكة"],
      "جغرافيا":["بني سويف","عمان","بحيرة البردويل","بيرو"],
      "علوم":["الثقب الأسود","الدماغ او المخ","16","22"],
    },
    {
      "قدرات ذهنية":["202","44","61","100"],
      "سفر القضاة":["يفتاح الجلعادي","اهل فنوئيل","بنيامين","المديانيين"],
      "رياضة":["سلاح الشيش","نيبوشا يوفوفيتش","لوثار ماتيوس","البرازيل"],
      "جغرافيا":["انقرة","اثينا","جمهورى","الجودو"],
      "علوم":["الهيموجلوبين","ابن سينا","2","Au"],
    },
    {
      "قدرات ذهنية":["49","20","199","1110"],
      "سفر القضاة":["من مدينة النخل(اريحا)","الكنعانيين","3 فرق","عجلون"],
      "رياضة":["نيجيريا","تي بي مازيمبي","مرة واحدة ","كرة السلة",],
      "جغرافيا":["الاطلنطي","7","الارخبيل","3(الهادي و الاطلنطي و المتجمد الشمالي)"],
      "علوم":["كربونات الصوديوم ( sodium carbonate)","الكبد","Ra","الغدد الليمفاوية"],
    },
    {
      "قدرات ذهنية":["350","206","630","107"],
      "سفر القضاة":["سيسرا","افرايم","اربع ايام","قرية اربع"],
      "رياضة":["علي فرج و نور الطيب","مصر","ماراثون","بيليه"],
      "جغرافيا":["الشمس","البحرين","3","اوروبا"],
      "علوم":["علم البيئة","هرتز","المشتري( ٦٧ كوكب)","Ag"],
    },
    {
      "قدرات ذهنية":[" "," "],
      "سفر القضاة":[],
      "رياضة":["أتليتكو مدريد","إيطاليا","غانا (٢٠٠٩)","يوفينتوس"],
      "جغرافيا":["بيونج يانج","الالمانية","تشيلي","اسبانيا"],
      "علوم":["1999","النيكوتين","4","نانومتر"],
    },
    {
      "قدرات ذهنية":[" "," "],
      "سفر القضاة":["",""],
      "رياضة":["محمد زيدان","كوريا الجنوبية","الاهلي","3"],
      "جغرافيا":["",""],
      "علوم":[""," "],
    },
    {
      "قدرات ذهنية":[" "," "],
      "سفر القضاة":["",""],
      "رياضة":["جول ريميه","انتر ميلان و ايه سي ميلان"],
      "جغرافيا":["",""],
      "علوم":[""," "],
    },
    {
      "قدرات ذهنية":[" "," "],
      "سفر القضاة":["",""],
      "رياضة":["رونالدينيو","بوب بيزلي"],
      "جغرافيا":["",""],
      "علوم":[""," "],
    },
    {
      "قدرات ذهنية":[" "," "],
      "سفر القضاة":["",""],
      "رياضة":["ويمبلدون (١١ ساعة)",""],
      "جغرافيا":["",""],
      "علوم":[""," "],
    },
  ];

}