class marathondata{
  List<List<String>> questions=[
    /*["كم قدم فى 5 ياردة؟","من كان ملقب بفنان الشعب؟","ما هو اخر سفر في العهد القديم؟","85*30+70*85"],*/
    /*["ما هي لغة التخاطب عند النحل؟","من هو الفنان الراحل الذي قام بدور القنصل في فيلم ابن القنصل؟","من هو اخر قاضي في الكتاب المقدس؟","حل المسألة الآتية 12*2 - 288/12  "],*/
    ["كم عدد ارجل النحلة؟","مخرج فيلم طيور الظلام","كم عدد شعب اسرائيل الذي ذهب لمحاربة المديانيين؟ (قض 7)","25*6+44*3"],
    ["ما هو علم الميثولوجيا؟","ما هى جنسية الرسام سلفادور دالي","الاصحاح الخامس من سفر القضاه عبارة عن ترنيمة فمن هما الاثنان اللذان رنموها؟","12*9+35*3"],
    ["من هي الملكة التي طبعت صورتها على أول طابع بريد في العالم؟","فى اى دولة ولد بيتهوفن","من هي الزانية التي خانت شمشون و سلمته لاعدائه؟ ( قض ١٦)","12*5/3+99-110"],
    ["ما هي اللغة الرسمية لدولة كوبا؟","في اي عام توفي الفنان احمد زكي","الجيل الذي اتي بعد موت يشوع عمل الشر في عيني الرب فماذا عبدوا؟ (قض٢  )","80*42/6-59"],
    ["ما هي الديانة الأكثر انتشارا في الهند؟","ما المجال الذى نبغ فيه الفرنسي كلود مونييه","من قائل العبارة التالية ` قوموا لأن الرب قد دفع إلى يدكم جيش المديانيين`؟ (قض 7)","123+321-222+165"],
    ["ما هو المكون الرئيسي للزجاج؟","من رسم لوحة ليلة النجوم “the starry night”","من الذي قال لغلامه `اخترط سيفك و اقتلني لئلا يقولوا عني قتلته امرأة`؟ (قض 9)","42+173+81-33"],
    ["ما هي أكبر مدن أستراليا من حيث التعداد السكاني؟","من مؤلف مسرحية عطيل","من الذي قتل زبح و صلمناع؟ (قض 8)","15*11-15*5"],
    ["ما هو الشئ الذي سماه العرب الأصفر الرنان؟","فى اى عام توفي مايكل جاكسون","كم عدد الفرق التي تقسمت اليها ال 300 رجل في الحرب مع المديانيين؟ ( قض 7)","88*8-8*76"],
    ["ما اسم الظاهرة الطبيعية التي يحدث فيها ارتفاع في منسوب مياه سطح البحر أو المحيط؟","من مؤلف موسيقى فيلم عسل اسود","كم سنة استراحت ارض إسرائيل بعد موت سيسرا؟ (قض ٥)","91/7+13*7"],
    ["قارة اسمها لاتيني و يعني الجنوب فما هي؟","من مؤلف رواية  يوتوبيا","قاضيا كان اعسر فمن هو؟ ( قض ٣)","102/6+15*4"],
    ["ما هي جنسية العالم ألبرت اينشتاين","ما الاله الموسيقية التي يجيدها نصير شمة","كم عدد اولاد يائير الجلعادي؟ (قض ١٠)","9*51+40*12"],
    ["من قائل هذه العبارة `في يوم من الايام لن يكون هناك غير ٥ ملوك ٤ ملوك فى ورق اللعب و ملك بريطانيا`؟","ما المهنة الاصلية لأحمد خالد توفيق","ما اسم ابن جدعون الذي ولدته سريته التي في شكيم؟ (قض ٨)","25*7-12*12"],
    ["ما هي القارة المعروفة باسم القارة السمراء؟","من صاحب المقال اليومى `مواقف` فى جريدة الاهرام","قاضية نبية و زوجة فيدوت فمن هي؟ (قض ٤)","14*7+21*3"],
    ["في اي دولة بأمريكا الشمالية يوجد أطول شارع في العالم؟","ما عدد اوتار الة التشيلو","","مجموع الارقام الزوجية بين 5و13"],
    ["ما هي اللغة الرسمية لدولة أذربيجان؟","من نحت تمثال نهضة مصر","","91/7+182/7"],
    ["ما هو الاسم القديم لجامعة القاهرة؟","من مؤلف رواية القاهرة الجديدة","","85+95+105+115"],
    ["ما اسم الظاهرة الكونية التي تحدث عند التفريغ الكهربائي بين سحابتين تحملان شحنتين مختلفتين؟","من قام بدور الشاويش عطية فى فيلم اسماعيل يس فى الاسطول","","62*12/24+15*15/25"],
    ["ما هي العملة الرسمية لجمهورية ايرلندا؟","من صاحبة اغنية كان ياما كان","","699/3+2*11*3"],
    ["بماذا تسمي الحلقة الضخمة الدوارة من الرياح و المطر؟","من صاحب البوم يوميات رجل مهزوم","","مجموع الارقام الزوجية من 21الى 29"],
    ["ما هي جنسية الممثل العالمي جاكي شان؟","من مؤلف كتاب `زملكاوى`","","25*7-25*2+25*12"],
    ["ما هي الآلة الموسيقية التي يعزف عليها الشخصية الخيالية تشيرلك هولمز؟","من قام بدور العسكرى هلال فى فيلم الارهاب و الكباب","","24/2/3/4+168/2/3/4"],
    ["كم عدد الألوان في علم جمهورية سلوفاكيا؟","من قام بدور هارى بوتر","","34+43+56+65"],

    /*
    * 21 ma3loomat 3ama
    * 21 fnoon
    * 13 kdaaa
    * 13 kdrat zhnia
    * */

  ];
  List<List<String>> answers=[
    /*["15","سيد درويش","ملاخي","8500"],*/
    /*["الرقص في الهواء","خالد صالح","صموئيل النبي","0"],*/
    ["6","شريف عرفة","300 رجل","282"],
    ["علم الأساطير و الخرافات ","اسباني","دبورة و باراق","213"],
    ["الملكة فيكتوريا ","المانيا","دليلة","9"],
    ["الاسبانية ","2005","البعليم (البعل و عشتاروث)","501"],
    ["الهندوسية","الرسم","جدعون","387"],
    ["الرمل ","فان جوخ","ابيمالك","263"],
    ["سيدني ","شكسبير","جدعون","90"],
    ["الذهب ","2009","3 فرق","96"],
    ["المد ","عمر خيرت","40 سنة","104"],
    [" أستراليا","احمد خالد توفيق","اهود بن جيرا","77"],
    [" ألماني","العود","30 ولد","939"],
    [" الملك فاروق","طبيب","ابيمالك","31"],
    ["أفريقيا ","انيس منصور","دبورة","161"],
    [" كندا ","4 اوتار","","36"],
    ["اللغة الاذرية ","محمود مختار","","39"],
    ["جامعة فؤاد الاول","نجيب محفوظ","","400"],
    ["البرق ","رياض القصبجي","","40"],
    [" اليورو","ميادة الحناوي","","299"],
    ["إعصار","قاظم الساهر","","100"],
    [" صيني","عمر طاهر","","425"],
    [" الكمان","اشرف عبد الباقي","","8"],
    ["3","دانيال رادكليف","","198"],
  ];
}
