class Nashan_Data{
  List<List<String>> questions=[

    /*[

       'كم مرة حقق نادي أياكس دوري أبطال أوروبا؟' ,
       "ما هو رقم تيشيرت النجم المصري محمد ابو تريكة؟" ,
       "في اي عم حدث زلزال في مصر و كانت قوته 5.8 ريختر و كان الاكثر تدميرا منذ عام 1847 ؟",
       "كم يبلغ طول سور الصين العظيم؟",
       "في عام ولد شكسبير؟",
      "ما عدد ادوار برج العرب بدبي؟"

  ],
    [
      "فى اى عام ولد محمد على بك الكبير؟",
      "ما العدد الذرى لليورانيوم؟",
      "عدد احرف اللغة الايطالية؟",
      "عدد السعرات الحرارية فى 200 جم مياة؟",
      "ما عدد احرف اسم القارة القطبية الجنوبية؟",
      "كم كان عمر ام كلثوم عنما ماتت؟",
    ],*/
    [
      "كم عدد صمامات البوق (trompeté) ؟",
      "كم عدد الدول المعترف بها في قارة اسيا؟",
      "كم عدد النجوم في علم بنما؟",
      "كم عدد الأعداد الاوليه حتى رقم ١٠٠؟",
      "كم قلب للاخطبوط؟",
      "من كم لاعب يتكون فريق كرة السلة؟",
    ],
    [
      "كم درجة مئوية تبلغ درجة حرارة الشمس؟",
      "كم بوصة في الياردة الواحدة؟",
      "متى حفر اول بئر بترولي في العالم؟",
      "كم تبلغ مساحة الكرة الأرضية؟",
      "كم عدد الاحبال الصوتية في جسم الإنسان؟",
      "متي وقعت عاصفة الصحراء بين العراق و قوات التحالف لتحرير الكويت؟",
    ],
    [
      "متي قامت أمريكا بأول رحلة فضائية؟",
      "ما هو الجزر التربيعي لرقم ١٦٩؟",
      "متى وقعت الحرب العالمية الأولى؟",
      "ما هي نسبة المياه من الكرة الأرضية؟",
      "جارث باري هو اكثر من لعب مباريات في الدوري الانجليزي الممتاز فكم مبارة لعب؟",
      "باتريك فييرا يعد من أكثر من حصل على بطاقات حمراء في الدوري الانجليزي فكم بطاقة حصل عليها؟",
    ],
    [
      "متي وقعت حادثة دنشواي؟",
      "كم يبلغ عدد أسنان الإنسان البالغ؟",
      "كم عدد عظام جسم الإنسان؟",
      "متي ألغيت الخلافة الإسلامية؟",
      "كم يبلغ عدد مسرحيات ويليام شكسبير؟",
      "ما هو مجموع ايام شهر يناير و فبراير و ديسمبر في السنة الكبيسة؟",
    ],
    [
      "كم شهر في سنتين و نصف؟",
      "كم عدد مصاطب هرم زوسر المدرج؟",
      "كم يبلغ عدد أوراق الكوتشينة اذا أضفنا لهم ورقي الجوكر؟",
      "ما هو مجموع افيال الشطرنج لكلا اللاعبين في المبارة؟",
      "كم رجل تمتلكها النملة؟",
      "كم عدد افلام سلسلة هاري بوتر؟",
    ],
    [
      "كم مرة تم عرض الحدث الأكبر علي الاطلاق Wrestlemania في WWE حتي الآن؟",
      "متى بدأت اول بطولة لدوري أبطال أوروبا؟",
      "ما هو الحد الأقصى لعدد اشواط الكرة الطائرة في المباراة الواحدة؟",
      "ما هي مدة الشوط الواحد في لعبة كرة اليد؟",
      "كم عدد حروف كلمة `الإسكندرية` ؟",
      "يعد متوشالح اكثر من عاش في الكتاب المقدس فكم سنة كانت مدة حياته؟",
    ],

    [
      "كم مباراة دولية لعب النجم المصري احمد حسن؟",
      "في اي سنة ميلادية توفي المعز لدين الله الفاطمي؟",
      "كم مليون كيلو متر مربع تبلغ مساحة قارة افريقيا؟",
      "ما هو العدد الذري لعنصر البلوميوم؟",
      "ما هو مجموع الدقائق في يومين و ربع؟",
      "كم عدد اجزاء مسلسل الدالي للنجم نور الشريف؟",
    ],

    [
      "كم مرة يتكرر رقم ٦ في الأرقام من ١ ل ٨٠؟",
      "كم عدد ذرات الأوكسجين في ثتائي كرومات البوتاسيوم؟",
      "كم عدد المرات فوز منتخب الاراجواي بكأس العالم",
      "في اي عام تولي الرئيس الأمريكي جورج واشنطن رئاسة امريكا؟",
      "ما هو ترتيب برج أميرة من حيث أطول الابراج في دبي؟",
      "كم يبلغ عدد أقمار كوكب زحل؟",
    ],

    [
      "16 * 16",
      "فى اي عام نالت الاردن استقلالها",
      "ما عدد احرف عاصمة البحرين",
      "ما دائرة العرض التى تحد مصر من الجنوب ",
      "فى اي عام تم اصدار البوم عودوني",
      "فى اى عام انتقل نيمار لبرشلونة",
    ],

    [
      "فى اى عام ولد محمد صلاح",
      "فى اي عام اصبح محمد على واليا على مصر",
      "فى اى عام انتج فيلم الارض",
      "كم متر يبلغ ارتفاع برج ايفل",
      "كم عدد مفاصل جسم الانسان البالغ",
      "كم عدد ولايات (محافظات) تونس",
    ],

    [
      "كم ثانية (بكسر عشرى) يستغرق الضوء للوصول من القمر للارض",
      "فى اى عام ولد الخديوى اسماعيل",
      "فى اى عام توفى الخديوى اسماعيل",
      "كم يبلغ ارتفاع قمة افرست",
      "كم مرة فازت ايطاليا بكاس العالم",
      "886+276"
    ],


    [
      " في اي سنة أصدر البنك الأهلي المصري شهادات الاستثمار؟",

  " ما هو العدد الذري لعنصر الروثينيوم؟",

   "رمسيس الثاني كان من حكام اي اسرة؟",

  " كم هدف احرزه النجم محمد صلاح في اخر موسم في الدوري الانجليزي؟",

   "في اي سنة ميلادية اقيم اول قداس علي مذبح كنيسة الشهيد العظيم مارجرجس سيدي بشر؟",

   "كم عدد ارجل سرطان البحر؟",

    ]


    ,
    [
    " ما هو العدد الذري لعنصر الرينيوم؟",

   'ما هو الجزر التكعيبي لرقم ١٣٣١؟',

  " في اي عام اغتيل الملك فيصل من الامير فيصل ابن اخيه؟",

   "كم عدد الثواني في ٣٢ دقيقة و نص؟",

  " كم عدد ارجل الجراد؟",

  "ما هي درجة غليان الايثانول؟",

    ]

  ];


  List<List<String>> answers=[
    /*[

      "4" ,
      "22" ,
      "1992",
      "21.196",
      "1564",
      "56"

    ],
    [
      "1769",
      "92",
      "21",
      "0",
      "10",
      "76",
    ],*/
    [
      "3",
      "48",
      "2",
      "25",
      "3",
      "5",
    ],
    [
      "15000000",
      "36",
      "1959",
      "510000000",
      "4",
      "1991",
    ],
    [
      "1962",
      "13",
      "1914",
      "71",
      "653",
      "8",
    ],
    [
      "1906",
      "32",
      "206",
      "1924",
      "37",
      "91",
    ],
    [
      "30",
      "6",
      "54",
      "4",
      "6",
      "8",
    ],
    [
      "37",
      "1955",
      "5",
      "30",
      "10",
      "969",
    ],

    [
      "184",
      "975",
      "30",
      "84",
      "3240",
      "3",
    ],

    [
      "18",
      "2",
      "65.5",
      "1789",
      "2",
      "82",
    ],

    [
      "256",
      "1946",
      "7",
      "22",
      "1998",
      "2013",
    ],
    [
      "1992",
      "1805",
      "1970",
      "324",
      "360",
      "24",
    ],

    [
      "1.3",
      "1830",
      "1895",
      "8849",
      "4",
      "1162",
    ],
    [
      "1965",
      "44",
      "19",
      "22",
      "1959",
      "10",
    ],

    [
      "75",
      "11",
      "1975",
      "1950",
      "6",
      "78",
    ],




  ];
}