class Sor3a_Data{
  List<String> questions=[
    "من هو مخترع المصباح الكهربي؟",
    "من هو المنتخب الفائز بكأس العالم عام ٢٠١٨؟",
    "كم ٧ في ال ٥٦؟",
    "من الفنان ااذي قام بالأداء الصوتي لمارد وشوشني في  شركة المرعبين المحدودة؟",
    "من هو العالم الذي اكتشف الجاذبية؟",
    "في اي قارة يقع نهر الامازون",
    "من اول رئيس لجمهورية مصر العربية",
    "3 * 3 * 3",
    "ما الحيوان المسمى بسفينة الصحراء"
  ];
  List<String> answers=[
    "توماس اديسون",
    "فرنسا",
    "8",
    "محمد هنيدي",
    "نيوتن",
    "امريكا الجنوبية",
    "محمد نجيب",
    "27",
    "الجمل"

  ];
}





/*١- من هو مخترع المصباح الكهربي؟
توماس اديسون
٢- من هو المنتخب الفائز بكأس العالم عام ٢٠١٨؟
فرنسا
٣- كم ٧ في ال ٥٦؟
٨
٤- من الفنان ااذي قام بالأداء الصوتي لمارد وشوشني في  شركة المرعبين المحدودة؟
محمد هنيدي
٥- من هو العالم الذي اكتشف الجاذبية؟
نيوتن*/