class Ta7t_El_Da5t_Data{
  List<List<String>> questions=[


   /* [
  	"ما هو نظام الحكم في سويسرا؟ ",
  " من هي الفنانة التي قامت بدور فريدة في فيلم اسف على الازعاج؟",
   "ما هو منتخب كره القدم الافريقي الملقب بالنسور الخضر؟",
   "الصهيل هو الاسم الصوتي لأحد الحيوانات فما هو؟",
   "من هو الرئيس الاول للولايات المتحدة الأمريكية؟" ,
   "ميكافلي هو كاتب و مفكر شهير فما هي جنسيته؟",
   "ما هو الرمز الكيميائي لعنصر النيكل؟" ,
  " راجعين هو ألبوم غنائي لمطرب مصري فمن هو؟" ,
   "ما هي العملة الرسمية لدولة الدنمارك؟"

  ],
    [
    "ما عدد الوان علم النمسا؟",
    "فى اي محيط يقع ميناء بيرل هاربر؟",
    "ما جنسية المعلق الرياضى عصام الشوالى ؟",
    "فى اى شهر تم الهجوم على هيروشيما و نجازاكى؟",
    "كم قدم للصرصار؟",
    "من مكتشف الراديوم؟",
    "من مخرج فيلم حليم؟",
    "فى اى ولاية توجد مدينة شيكاغو؟",
    "من يحمل رقم 19 فى نادى الزمالك؟ ",
  ],*/
    [
      "الي اي جولة أوروبية تتبع جزيرة البا؟",
      "دارت معركة المقطع بين الجيوش الفرنسيين و احدي دول شمال افريقيا فما هي؟",
      "ما هو العدد الذري لعنصر الكالسيوم؟",
      "كم عدد الوان علم دولة إستونيا؟",
      "من هو الفنان الذي لعب دور ابو جودة في فيلم إعدام ميت؟",
      "الي اي محافظة مصرية تتبع مدينة دمنهور؟",
      "ما هو نظام الحكم في دولة أفغانستان؟",
      "من هو الموسيقار و المطرب المصري الراخل صاحب اغنية لما انت ناوي؟",
      "ما هي عاصمة الامارات؟",
    ],
    [
      "جزيرة وايك هي محمية طبيعية تقع بأحد المحيطات فما هو؟",
      "ما هو نظام الحكم في دولة الراس الاخضر؟",
      "ما هي الفنانة التي قامت ببطولة مسلسل سقوط حر؟",
      "كم عدد الوان علم دولة السودان؟",
      "ما هو الرمز الكيميائي لعنصر التنجستن؟",
      "في اي دولة من دول أمريكا الجنوبية تقع مدينة لانوس؟",
      "من هو الكاتب المصري الراحل صاحب كتاب موسوعة الظلام؟",
      "الي اي دولة أوروبية تتبع جزيرة سردينيا؟",
      "ما هي عاصمة الهند؟",
    ],

    [
      "في اي قارة من قارات العالم يقع نهر ميسوري؟",
      "ما هو نظام الحكم في دولة البوسنة و الهرسك؟",
      "في عام ١٨٢٠ نالت الاكوادور استقلالها من احدي الدول الاوروبية فما هي؟",
      "جون راي هو احد اشهر علماء الطبيعة فما هي جنسيته؟",
      "من هي الفنانة التي قامت بغناء اغنية حكاية واحدة من فيلم هيبتا؟",
      "من هو الكاتب المصري الراحل صاحب كتاب قراءة للمستقبل؟",
      "كم عدد الوان علم دولة الجزائر؟",
      "من هو الفنان الذي قام بدور هريدي عمران في فيلم الفتوة؟",
      "ما هو العدد الذري للهيليوم؟",
    ],
    [
      "من هو الفنان الذي قام بغناء لكل عاشق وطن؟",
      "في اي خليج يصب نهر جانج؟",
      "كم عدد الوان علم دولة باكستان؟",
      "الي اي دولة تتبع شبه جزيرة كولا؟",
      "الحبشة هو الاسم القديم لأحد الدول الافريقية فما هي؟",
      "ما هو نظام الحكم في دولة باراجواي؟",
      "ما هي عاصمة الدنمارك؟",
      "من هي الفنانة التي قامت بدور لامياء في مسلسل سابع جار؟",
      "ما هو الرمز الكيميائي لعنصرالاريديام؟",
    ],

    [
      "ما هو نظام الحكم في دولة تركمنيستان؟",
      "في اي قارة يقع نهر ماجدلينا؟",
      "ما هو الرمز الكيميائي لعنصر الاوسميوم؟",
      "كم عدد الوان علم دولة بروندي؟",
      "من هي الفنانة التي قامت ببطولة مسلسل كاريوكا؟",
      "عن اي دول استقلت ألبانيا عام ١٩١٢؟",
      "من هو الفنان الذي لعب دور سمسم في فيلم كده رضا؟",
      "ما هي عاصمة المغرب؟",
      "العالم الفيزيائي اميلو افوجادرو من أشهر علماء الفيزياء فما هي جنسيته؟",
    ],

    [
      "ما هو نظام الحكم في دولة لاوس؟",
      "في اي قارة يقع نهر يوقون؟",
      "ما هو الرمز الكيميائي لعنصر التيلوريوم؟",
      "كم عدد الوان علم دولة بيرو؟",
      "في اي دولة آسيوية تقع محافظة أذربيجان الشرقية؟",
      "من هو الفنان الذي قام ببطولة فيلم ابن عز؟",
      "الي اي عصر أدبي ينتمي النابغة الذبياني؟",
      "ما هي جنسية العالم الشهير ستيفن هوكنج؟",
      "في اي محيط تقع جزر القمر؟",
    ],

    [
      "من هو الفنان الذي قام بدور ابو فياض في فيلم المصلحة؟",
      "عند حدوث نزيف الانف لأي اتجاه يجب إمالة راس المصاب؟",
      "ما هي جنسية الاديب جون شتاينبك مؤلف رواية the pearl؟",
      "كم عدد الوان علم دولة بنجلادش؟",
      "ما هو نظام الحكم في ألبانيا؟",
      "ما هي المكونات الغذائية الأساسية التي تبني الجسم؟",
      "في اي محيط تقع جزر مارشال؟",
      "في اي مدينة مصرية أقيمت اول دورة لألعاب البحر الأبيض المتوسط؟",
      "في اي قارة تقع كندا؟",
    ],

    [
      "ما هو نظام الحكم في دولة كينيا؟",
      "في اي دولة أقيمت كاس الأمم الاسيوية لكرة القدم عام ٢٠١٩؟",
      "في اي دولة تقع مدينة بورصة؟",
      "من هو الفنان الذي قام بدور عبد الحميد في مسلسل حضرة المتهم ابي؟",
      "فيروس HIV يصيب احد أجهزة الجسم فما هو",
      "من هي الفنانة التي قامت بدور شفيقة في فيلم تيمور و شفيقة؟",
      "كم عدد الوان علم دولة ميانمار؟",
      "ما هو الرمز الكيميائي لعنصر النحاس؟",
      "ما هي جنسية جاك مار الذي نحت تمثال لاظوغلي باشا؟",
    ],
    [
      "من هي المطربة اللبنانية صاحبة اغنية مشوار؟",
      "في اي قارة تقع صحراء الرمل الكبري؟",
      "من الذي قام بدور البطولة في مسلسل حدائق الشيطان؟",
      "في اي محيط تقع جزر mid way",
      "من هو الاديب المصري الراحل صاحب كتاب حديث الأربعاء؟",
      "ما هو الفيتامين الذي يرتبط نقصه بمرض العشاء الليلي؟",
      "ما هي عاصمة سويسرا؟",
      "في اي محيط تقع جزيرة كريسماس؟",
      "ما هو الرقم الذري لعنصر الكلورين؟",
    ],
    [
      "من هو النادي الاكثر تتويجا بكأس السوبر الفرنسي؟",
      "في اي جزء داخلي في الرأس يقع مركز التنفس؟",
      "مادة في جسم الإنسان يتسبب نقصها في تحول الشعر للون الأبيض لكبار السن؟",
      "ما هي جنسية الأديب و المفكر الراحل امين الريحاني؟",
      "ما هو الرقم الذري لعنصر البوتاسيوم؟",
      "ما هو نظام الحكم في الارجنتين؟",
      "من هي الفنانة التي قامت بدور جليلة في مسلسل حديث الصباح و المساء؟",
      "زايد بن سلطان آل نهيان هو أول رئيس لإحدى دول الخليج فما هي؟",
      "كم عدد الاوردة الرئوية في جسم الإنسان البالغ؟",
    ],



    [
      "ما هي جنسية العالم روبرت بويل احد مؤسسي الكيمياء الحديثة؟",
      "من هو المطرب و الملحن الذي غني و حياتك يا حبيبي؟",
      "في اي دولة عربية يقع مطار الزهران؟",
      "في اي دولة يقع المقر الرئيسي للاتحاد الدولي للتنس؟",
      "ما هو الرمز الكيميائي لعنصر الفناديوم؟",
      "في اي مدينة أوروبية توفي الشاعر السوري نزار قباني؟",
      "ما هي جنسية الملاكم العالمي نسيم حميد الي جانب اليمنية؟",
      "كم عدد الوان علم دولة النمسا؟",
      "من هو الفنان الذي لعب دور يحيا في مسلسل ظل الرئيس؟",
    ],

    [
      "في اي بحر يصب النهر الابيض؟",
      "من كم لون يتكون علم انجلترا؟",
      "من هي المطربة التونسية صاحبة اغنية في الكام يوم اللي فاتوا؟",
      "ما هو نظام الحكم في المكسيك؟",
      "من هو الفنان الذي لعب دور جلال في فيلم جزيرة الشيطان؟",
      "ما هي جنسية الطبيب هنري هيمليك مبتكر مناورة هيمليك؟",
      "عن اي دولة استقلت كازاخستان عام ١٩٩١؟",
      "ما هو الرمز الكيميائي للعنصر الاصطناعي الكوريوم؟",
      "ما هو الجامع المرسوم علي ورقة العملة المصرية فئة ال ١٠٠ جنيه؟",
    ],

    [
      "من هي الروائية المصرية صاحبة رواية سراج؟",
      "في اي دولة أوروبية تقع مدينة اوديسا؟",
      "ما هي فئة العملة الأمريكية التي يوجد عليها صورة الرئيس جورج واشنطن؟",
      "من هو الفنان الذي لعب دور عبد العزيز في مسلسل شارع عبد العزيز؟",
      "في اي دولة من دول شمال افريقيا وقعت معركة القطار؟",
      "في اي الولايات الأمريكية يقع المقر الرئيسي للامم المتحدة؟",
      "من هو الأديب المصري صاحب المجموعة القصصية صباح الورد؟",
      "ما هي جنسية عالم الفيزياء و الفلك يوهانس كيبلر؟",
      "ما هي النسبة المئوية التي لا يجب ان تقل عنها نسبة تركيز الأكسجين في الدم؟",
    ],

    [
      "كم عدد الوان علم دولة اسكتلندا؟",
      "ما هي عاصمة السعودية؟",
      "في اي قارة تقع جمهورية البانيا؟",
      "من هو الفنان الراحل الذي قام بدور عرابي في فيلم مسجون ترانزيت؟",
      "يفصل مضيق جوهر بين ماليزيا و دولة اسيوية اخري فما هي؟",
      "ما هو العدد الذري لعنصر اليورانسيوم؟",
      "ما هو منتخب كره القدم الافريقي الملقب بالنجوم السوداء؟",
      "من الشاعر الفلسطيني صاحب ديوان أوراق الزيتون؟",
      "ما هي زاوية الحقل العضلي؟",
    ],



    [
      "كم عدد الفقرات الصدرية بالعمود الفقري؟",
      "ماذا يطلق على صوت الفيل؟",
      "ما هو الفيتامين اي يرتبط نقصه بمرض الكساح او لين العظام؟",
      "ما هو الرمز الكيميائي لعنصر الزينون؟",
      "من كان حارس المنتخب المصري في كاس امم افريقيا عام ٢٠٠٦؟",
      "ما هي الدولة المستضيفة لبطولة كوبا أمريكا ٢٠١٩؟",
      "كم عدد الوان علم دولة فيتنام؟",
      "من هو مؤسس الدولة الطولونية في مصر؟",
      "من هو الفنان الذي غني الطيب احسن؟",
    ],



  ];
}